"{:about         {:name     {:first \"Markus\", :last \"Walther\"},\n                 :position \"Software Engineer\",\n                 :contact  {:email    \"contact@markwalther.ch\",\n                            :phone    \"Phone REDACTED\",\n                            :street   \"Street REDACTED\",\n                            :city     \"Bristol\",\n                            :postcode \"Postcode REDACTED\",\n                            :country  \"United Kingdom\",\n                            :website  \"markwalther.ch\",\n                            :github   \"markus-wa\"},\n                 :birth    {:year 1997, :location \"Berne, Switzerland\"},\n                 :summary  \"Highly passionate Software Engineer from Berne who enjoys working with bright people. Enthusiastic about writing performant and robust code with an ideal skill set for developing large, distributed applications.\"},\n :experience    [{:company         \"Hewlett Packard Enterprise, CMS\",\n                  :location        \"Berne, Switzerland\",\n                  :position        \"Technical Consultant\",\n                  :timeperiod      \"September 2018 - March 2020\",\n                  :description     \"Following the promotion to Technical Consultant, I started taking on further responsibilities in the Team and helped guide the technical direction of Swisscom's Wholesale Service Gateway (WSG) system. The software is a order-management system used by all Internet Service Providers in Switzerland. It handles provisioning of the underlying connection technology (Copper/Fiber) as well as services (TV/Internet) and SLA-assurance/incidents.\",\n                  :tasks           [\"Analysis, design and implementation of new requirements\"\n                                    \"Develop migration plans/strategies and present them to the customer\"\n                                    \"Analysis and mitigation of performance issues in business-critical components\"],\n                  :accomplishments [\"Migration of old Perl-based application to Angular 6 with Spring Boot as backend\"\n                                    \"Dockerized a large Oracle database for the QA team\"\n                                    \"Adoption of best-practices and modern tools (TDD, Lombok, IntelliJ)\"]}\n                 {:company         \"Hewlett Packard Enterprise, CMS\",\n                  :location        \"Berne, Switzerland\",\n                  :position        \"IT Student / Software Developer\",\n                  :timeperiod      \"September 2016 - September 2018\",\n                  :description     \"After finishing my apprenticeship I joined the Communications & Media Services (CMS) department at HPE under a short term student-contract. There I was part of the Wholesale Service Gateway (WSG) development team and was able to expand and solidify my skills further.\",\n                  :tasks           [\"Analysis, design and implementation of new requirements\"\n                                    \"Bug fixing\"\n                                    \"Third level support\"],\n                  :accomplishments [\"Migrated the version control and build systems of a very large monolith from SVN to Git and Ant to Gradle, reducing the average build time from one hour to five minutes\"\n                                    \"Implemented a Continuous Integration & Deployment pipeline in Jenkins\"\n                                    \"Development of the first RESTful web services in the WSG using a contract-first approach with Swagger/OpenAPI\"]}\n                 {:company         \"Hewlett Packard Enterprise, BSC\",\n                  :location        \"Berne, Switzerland\",\n                  :position        \"IT Apprentice\",\n                  :timeperiod      \"August 2012 - August 2016\",\n                  :description     \"During my apprenticeship at Hewlett Packard Enterprise I was able to obtain great first experiences in the world of large scale software development. As an apprentice I was part of the Banking Service Center (BSC) product-development team, creating modular parts of the IBIS3G core banking solution.\",\n                  :tasks           [\"Implementation of new requirements (Java)\" \"Bug fixing\"],\n                  :accomplishments [\"Rewrote a deprecated piece of software for managing banking information such as branch offices, bank document templates and currencies.\"\n                                    \"Development of a worklist management application consisting of a Java GUI plugin, an EJB web service and a database scheme.\"]}],\n :education     [{:at          \"TEKO\",\n                  :location    \"Berne, Switzerland\",\n                  :degree      \"Advanced Federal Diploma of Higher Education in Information Technology\",\n                  :timeperiod  \"October 2016 - October 2019\",\n                  :description \"Majoring in Software Engineering I gained new insights in the areas of architecture and design of large systems. Additionally I was introduced to various new areas like Micro Electronics, Embedded Software and Android app development.\",\n                  :website     \"https://teko.ch\"}\n                 {:at          \"GIBB\",\n                  :location    \"Berne, Switzerland\",\n                  :degree      \"Federal VET Diploma in Information Technology\",\n                  :timeperiod  \"August 2012 - August 2016\",\n                  :description \"During my apprenticeship I also attended vocational school with focus on Software Development. There I learned about best practices, design patterns and project management.\",\n                  :website     \"https://gibb.ch\"}],\n :skills        [{:level \"Very Good\",\n                  :entries [\"Java 8\" \"Angular 7\" \"Go\" \"Gradle\"]},\n                 {:level \"Good\",\n                  :entries [\"Kotlin\"\n                              \"Clojue\"\n                              \"Docker\"\n                              \"Git\"\n                              \"Spring Boot\"\n                              \"REST\"\n                              \"OpenAPI\"\n                              \"Linux\"\n                              \"DevOps\"\n                              \"TDD\"]}\n                 {:level \"Basics\",\n                  :entries [\"Python\" \"Groovy\" \"C++\" \"JPA\" \"Kubernetes\" \"Apache Tomcat\" \"SOAP\" \"HTML\" \"CSS\"]}],\n :projects      [{:name        \"demoinfocs-golang\",\n                  :platform    \"Library\",\n                  :description \"A library for parsing and analysing replays (aka. demos) of the game Counter-Strike: Global Offensive with over 2'000 downloads per week.\",\n                  :url         \"https://github.com/markus-wa/demoinfocs-golang\"}],\n :contributions [{:name        \"openapi-generator\",\n                  :description \"Improvements and bug fixes in the Java CXF generator.\",\n                  :url         \"https://github.com/OpenAPITools/openapi-generator\"}],\n :languages     [{:name \"German\", :level \"mother tongue\"}\n                 {:name \"English\", :level \"fluent, CEFR C1\"}],\n :certificates  [{:issuer \"Cambridge English\", :name \"Business English Certificate Vantage\"}\n                 {:issuer \"Scrum.org\", :name \"Professional Scrum Master I\"}]}\n"